meeting/minutes/2026/05-12.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 165 Minutes 2026-05-12</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 165 Minutes 2026-05-12</h1>
<p>
<a href="../">Meeting index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/2]</code></a></li>
<li><a href="#minutes">Draft Minutes</a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[8/10]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#approve-minutes">1.3. Approve minutes of the previous meeting</a></li>
<li><a href="#next-meeting">1.4. Next meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[1/3]</code></a></li>
<li><a href="#open-pull-requests">1.6. Review of open pull requests and issues</a>
<ul>
<li><a href="#blocked">1.6.1. Blocked</a></li>
<li><a href="#merge-without-discussion">1.6.2. Merge without discussion</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical agenda</a>
<ul>
<li><a href="#pr-2616">2.1. PR #2616: 2613b Additional notes, examples, and clarifications for xsl:array-member</a></li>
<li><a href="#pr-2611">2.2. PR #2611: 2598 New function fn:regex</a></li>
<li><a href="#pr-2609">2.3. PR #2609: QT4CG-156-03 Revise text on JNode identity</a></li>
<li><a href="#pr-2603">2.4. PR #2603: 2602 EXPath file and binary modules as optional features</a></li>
<li><a href="#pr-2601">2.5. PR #2601: 2568 Error code changes for dateTime functions</a></li>
<li><a href="#pr-2596">2.6. PR #2596: 2580 Map patterns</a></li>
<li><a href="#pr-2566">2.7. PR #2566: 1979 Records with type annotations</a></li>
<li><a href="#pr-2594">2.8. PR #2594: 2389 Adaptive Serialization: more freedom</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
</ul>
</div>
</div>
<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/2]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-160-02: NW to think about how to promote the dated drafts for broader community feedback.</li>
</ul>
</div>
</div>
<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Draft Minutes</h2>
<div class="outline-text-2" id="text-minutes">
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[8/10]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets: AP, JLO.
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> David J Birnbaum (DB)</li>
<li class="on"><code>[X]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK) [x:25-]</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="off"><code>[&#xa0;]</code> Juri Leino (JLO)</li>
<li class="on"><code>[X]</code> John Lumley (JWL)</li>
<li class="off"><code>[&#xa0;]</code> Alan Painter (AP)</li>
<li class="on"><code>[X]</code> Wendell Piez (WP)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW) <i>Scribe</i>. <i>Chair</i>.</li>
</ul>
</div>
</div>
<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
JK points out that PR #2595 was accepted last week. I’ve removed it from today’s agenda.
</p>

<p>
Proposal: Accept <a href="../../agenda/2026/05-12.html">the agenda</a>, as amended.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2026/05-05.html">the minutes of the previous meeting</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting is planned for 19 May 2026.
</p>

<p>
Possible regrets from DB.
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[1/3]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-160-02: NW to think about how to promote the dated drafts for broader community feedback.</li>
<li class="on"><code>[X]</code> QT4CG-165-01: NW to follow-up with the generator authors and schedule another discussion
<ul class="org-ul">
<li>NW sent email today</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: 716 Deferred Evaluation in XPath - the f:generator record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2350">#2350</a>: 708 An alternative proposal for generators</li>
</ul>
</div>
</div>
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2623">#2623</a>: 2621 Add reference to post-process option</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2622">#2622</a>: 2612 fn:char: Support \b and \f</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2618">#2618</a>: 2585 (part) Clarify error handling on date/time/duration arithmetic</li>
</ul>

<p>
Proposal: accept without discussion.
</p>

<p>
Accepted.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-pr-2616" class="outline-3">
<h3 id="pr-2616"><span class="section-number-3">2.1.</span> PR #2616: 2613b Additional notes, examples, and clarifications for xsl:array-member</h3>
<div class="outline-text-3" id="text-pr-2616">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2616">#2616</a>
</p>

<ul class="org-ul">
<li>MK: There is a technical change here.
<ul class="org-ul">
<li>… One of the comments last week asked about what would happen if you put
array-member in place of sequence in the example.</li>
<li>… They’d be double wrapped</li>
<li>… So I’ve changed the specification so that it doesn’t double wrap them, or raise an error.</li>
</ul></li>
<li>JWL: There’s a bit about never using array member in a for each; would that raise a static error?</li>
<li>MK: That’s a good question. Yes, you’d get XTDE4060. It could be detected statically sometimes.
<ul class="org-ul">
<li>We could possibly make that a type error.</li>
</ul></li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
