meeting/minutes/2026/05-12.org
** PR #2611: 2598 New function fn:regex
:PROPERTIES:
:CUSTOM_ID: pr-2611
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2611][#2611]]

Not ready for discussion.

** PR #2609: QT4CG-156-03 Revise text on JNode identity
:PROPERTIES:
:CUSTOM_ID: pr-2609
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2609][#2609]]

+ MK: I think there’s a cosmetic change in XQuery, but the substantive changes is in F&O.
  + … Yes.
+ MK: In F&O, we add introductory material to 16.1, Functions on JNodes
  + … The text on ~fn:jtree~ changes. In particular, the second paragraph about identity.
  + … The concept of identity for maps and arrays is only weakly defined.
  + … I’ve simplified some of the examples.

Proposal: accept this PR.

Accepted.

** PR #2603: 2602 EXPath file and binary modules as optional features
:PROPERTIES:
:CUSTOM_ID: pr-2603
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2603][#2603]]

+ MK: There are details about what the implications are.
+ MK: In XQuery,
  + … In conformance, we list the details about what it means to support the Binary Library Feature
  + … (Or what it means not to).
  + … For the File Library Feature, the requirement is imposed that you provide
    implementation-defined mechanism related to side-effects.

Proposal: accept this PR.

Accepted.

** PR #2601: 2568 Error code changes for dateTime functions
:PROPERTIES:
:CUSTOM_ID: pr-2601
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2601][#2601]]

+ NW: I think Sheila has done what we asked.

Proposal: accept this PR.

Accepted.

** PR #2596: 2580 Map patterns
:PROPERTIES:
:CUSTOM_ID: pr-2596
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2596][#2596]]

MK introduces the PR; this is a slight revision of what we had before.

+ MK: I see this as a step in a pipeline; the project of applying template rules
  to maps and arrays in trees is currently incomplete. We still need to define
  builtin templates, modes, and such.
  + … But we need better match patterns for them.
  + … Matching maps by type annotations means that we need additonal mechanisms
    to match structurally.
+ MK: It’s a new top-level pattern, ~MapPattern~.
  + … (The expansion in 6.3.2.4 is too verbose; but that’s editorial.)

MK describes the syntax and walks through the following examples.

+ MK: The default priority rules are pretty basic and follows the general principles.

+ JWL: In the first example, how would write the pattern that I wanted something to be either the first or the last?
+ MK: You can’t do that directly.
+ JWL: The keys can be QNames, could you end up with a QName with a colon in it?

Some discussion of wether or not the colon could be ambiguous. Consensus: no.

+ MK: The usual problem with colons, that you need to follow them with a space, will apply.
+ JK: I think the PR is great, I wonder how record types will be invoked in the match pattern.
+ MK: Yes, that’s a separate topic because records are changing and I’m trying to keep things separate.
  + … This is one step along the way.

Proposal: accept this PR.

Accepted.

** PR #2566: 1979 Records with type annotations
:PROPERTIES:
:CUSTOM_ID: pr-2566
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2566][#2566]]

+ MK: This has been reviewed before; this is a response to comments.

+ MK: It’s a data model change, so we’ll start there and then go to the XQuery spec.

+ MK: In the data model,
  + … A ~record~ is now a distinguished thing. It’s a map that is constrained by a record type definition.
  + … In the type hierarchy, record is a subtype of map.
  + … A record has a type annotation.
  + … Section 8.3 outlines what a record is. Two new accessors:
    + … ~record-get-value~ accessor 
    + … ~record-replace-value~ accessor
  + … The key thing about replace value is that it constructs a new instance of
    the record type with the same type annotation, so the replacement may not change the type.

+ MK: In XQuery,
  + … We reintroduce syntax for ~AnyRecordType~.
  + … Record types are defined in the appropriate section.
  + … The whole purpose of the proposal is to enable stronger type checking.
  + … At the time of writing, it’s not required that an ~instance of~ check must have the same type annotation. It’s structural.
    + … I’m not sure if that’s going to be the final state of affairs.
    + … If we want to do a check on the type annotation, we need to introduce derivation so that one record type can extend another.
  + … For the moment, this is workable but we could go further.
  + … Records are created by coercing a map to the required record type.
  + … Record types may be anonymous or named, for useful reasons.

There’s an open editorial issue that we need an appendix that lists all the builtin record types.

+ MK: Using a record type in a signature causes coercion to happen.

+ MK: Record are maps, so they’re also function items. We explain the signature of the corresponding function item.
+ MK: Some slight changes in the subtyping rules.
  + … Fields are no longer optional or mandatory, but they can be empty.
+ MK: Coercion rules are defined for records.
+ MK: There’s a new ~RecordPutExpr~, (~+:=~)
+ MK: It’s a type error to attempt to access a field that’s not part of the record type.
+ MK: There’s a new operator ~+:=~ that updates a record.
  + … The ~+:=~ operator is type safe.
+ MK: Some examples are updated.
+ MK: You can declare record types in the prolog.
  + … It’s simplified because we no longer have optional fields; the constructor functions are much simpler.
+ MK: That’s basically it, other specs are updated in equivalent ways.

+ CG: Thanks again. I think my comments haven’t been incorporated yet. Could we look at those?

MK agrees to review the comments.

