meeting/minutes/2026/05-12.html
<div id="outline-container-pr-2611" class="outline-3">
<h3 id="pr-2611"><span class="section-number-3">2.2.</span> PR #2611: 2598 New function fn:regex</h3>
<div class="outline-text-3" id="text-pr-2611">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2611">#2611</a>
</p>

<p>
Not ready for discussion.
</p>
</div>
</div>
<div id="outline-container-pr-2609" class="outline-3">
<h3 id="pr-2609"><span class="section-number-3">2.3.</span> PR #2609: QT4CG-156-03 Revise text on JNode identity</h3>
<div class="outline-text-3" id="text-pr-2609">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2609">#2609</a>
</p>

<ul class="org-ul">
<li>MK: I think there’s a cosmetic change in XQuery, but the substantive changes is in F&amp;O.
<ul class="org-ul">
<li>… Yes.</li>
</ul></li>
<li>MK: In F&amp;O, we add introductory material to 16.1, Functions on JNodes
<ul class="org-ul">
<li>… The text on <code>fn:jtree</code> changes. In particular, the second paragraph about identity.</li>
<li>… The concept of identity for maps and arrays is only weakly defined.</li>
<li>… I’ve simplified some of the examples.</li>
</ul></li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2603" class="outline-3">
<h3 id="pr-2603"><span class="section-number-3">2.4.</span> PR #2603: 2602 EXPath file and binary modules as optional features</h3>
<div class="outline-text-3" id="text-pr-2603">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2603">#2603</a>
</p>

<ul class="org-ul">
<li>MK: There are details about what the implications are.</li>
<li>MK: In XQuery,
<ul class="org-ul">
<li>… In conformance, we list the details about what it means to support the Binary Library Feature</li>
<li>… (Or what it means not to).</li>
<li>… For the File Library Feature, the requirement is imposed that you provide
implementation-defined mechanism related to side-effects.</li>
</ul></li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2601" class="outline-3">
<h3 id="pr-2601"><span class="section-number-3">2.5.</span> PR #2601: 2568 Error code changes for dateTime functions</h3>
<div class="outline-text-3" id="text-pr-2601">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2601">#2601</a>
</p>

<ul class="org-ul">
<li>NW: I think Sheila has done what we asked.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2596" class="outline-3">
<h3 id="pr-2596"><span class="section-number-3">2.6.</span> PR #2596: 2580 Map patterns</h3>
<div class="outline-text-3" id="text-pr-2596">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2596">#2596</a>
</p>

<p>
MK introduces the PR; this is a slight revision of what we had before.
</p>

<ul class="org-ul">
<li>MK: I see this as a step in a pipeline; the project of applying template rules
to maps and arrays in trees is currently incomplete. We still need to define
builtin templates, modes, and such.
<ul class="org-ul">
<li>… But we need better match patterns for them.</li>
<li>… Matching maps by type annotations means that we need additonal mechanisms
to match structurally.</li>
</ul></li>
<li>MK: It’s a new top-level pattern, <code>MapPattern</code>.
<ul class="org-ul">
<li>… (The expansion in 6.3.2.4 is too verbose; but that’s editorial.)</li>
</ul></li>
</ul>

<p>
MK describes the syntax and walks through the following examples.
</p>

<ul class="org-ul">
<li>MK: The default priority rules are pretty basic and follows the general principles.</li>

<li>JWL: In the first example, how would write the pattern that I wanted something to be either the first or the last?</li>
<li>MK: You can’t do that directly.</li>
<li>JWL: The keys can be QNames, could you end up with a QName with a colon in it?</li>
</ul>

<p>
Some discussion of wether or not the colon could be ambiguous. Consensus: no.
</p>

<ul class="org-ul">
<li>MK: The usual problem with colons, that you need to follow them with a space, will apply.</li>
<li>JK: I think the PR is great, I wonder how record types will be invoked in the match pattern.</li>
<li>MK: Yes, that’s a separate topic because records are changing and I’m trying to keep things separate.
<ul class="org-ul">
<li>… This is one step along the way.</li>
</ul></li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2566" class="outline-3">
<h3 id="pr-2566"><span class="section-number-3">2.7.</span> PR #2566: 1979 Records with type annotations</h3>
<div class="outline-text-3" id="text-pr-2566">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2566">#2566</a>
</p>

<ul class="org-ul">
<li>MK: This has been reviewed before; this is a response to comments.</li>

<li>MK: It’s a data model change, so we’ll start there and then go to the XQuery spec.</li>

<li>MK: In the data model,
<ul class="org-ul">
<li>… A <code>record</code> is now a distinguished thing. It’s a map that is constrained by a record type definition.</li>
<li>… In the type hierarchy, record is a subtype of map.</li>
<li>… A record has a type annotation.</li>
<li>… Section 8.3 outlines what a record is. Two new accessors:
<ul class="org-ul">
<li>… <code>record-get-value</code> accessor</li>
<li>… <code>record-replace-value</code> accessor</li>
</ul></li>
<li>… The key thing about replace value is that it constructs a new instance of
the record type with the same type annotation, so the replacement may not change the type.</li>
</ul></li>

<li>MK: In XQuery,
<ul class="org-ul">
<li>… We reintroduce syntax for <code>AnyRecordType</code>.</li>
<li>… Record types are defined in the appropriate section.</li>
<li>… The whole purpose of the proposal is to enable stronger type checking.</li>
<li>… At the time of writing, it’s not required that an <code>instance of</code> check must have the same type annotation. It’s structural.
<ul class="org-ul">
<li>… I’m not sure if that’s going to be the final state of affairs.</li>
<li>… If we want to do a check on the type annotation, we need to introduce derivation so that one record type can extend another.</li>
</ul></li>
<li>… For the moment, this is workable but we could go further.</li>
<li>… Records are created by coercing a map to the required record type.</li>
<li>… Record types may be anonymous or named, for useful reasons.</li>
</ul></li>
</ul>

<p>
There’s an open editorial issue that we need an appendix that lists all the builtin record types.
</p>

<ul class="org-ul">
<li>MK: Using a record type in a signature causes coercion to happen.</li>

<li>MK: Record are maps, so they’re also function items. We explain the signature of the corresponding function item.</li>
<li>MK: Some slight changes in the subtyping rules.
<ul class="org-ul">
<li>… Fields are no longer optional or mandatory, but they can be empty.</li>
</ul></li>
<li>MK: Coercion rules are defined for records.</li>
<li>MK: There’s a new <code>RecordPutExpr</code>, (<code>+:=</code>)</li>
<li>MK: It’s a type error to attempt to access a field that’s not part of the record type.</li>
<li>MK: There’s a new operator <code>+:=</code> that updates a record.
<ul class="org-ul">
<li>… The <code>+:=</code> operator is type safe.</li>
</ul></li>
<li>MK: Some examples are updated.</li>
<li>MK: You can declare record types in the prolog.
<ul class="org-ul">
<li>… It’s simplified because we no longer have optional fields; the constructor functions are much simpler.</li>
</ul></li>
<li>MK: That’s basically it, other specs are updated in equivalent ways.</li>

<li>CG: Thanks again. I think my comments haven’t been incorporated yet. Could we look at those?</li>
</ul>

<p>
MK agrees to review the comments.
</p>
</div>
</div>
