meeting/minutes/2026/05-12.org
** PR #2594: 2389 Adaptive Serialization: more freedom
:PROPERTIES:
:CUSTOM_ID: pr-2594
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2594][#2594]]

+ CG: This basically results from user feedback. It effects the adaptive serialization method.
+ CG: As JSON becomes more common, we regularly encounter numbers that
  represented as doubles, so 100 becomes 1E2.
  + … To make the adaptive serialization more useful, I propose making some of
    these more implementation defined.
+ CG: The “&” needs to be escaped to “&amp;” in strings for XQuery, but not for XPath.
+ MK: The question is what are we trying to achieve. The reason for the numeric
  format had in mind a sort of debugging use case.
  + … It’s intended to signal that it’s a double not an integer. It allows users
    to tell that it’s not an integer. That’s appropriate for some use cases and not others.
  + … Generally, the whole issue of escaping characters that might be hard to distinguish is tricky.
  + … I thought it was a bit odd to escape  “&” without also escaping angle brackets. But I can’t give a precise rational.
+ RD: The challenge with things like non-breaking space is that it’s used in
  some cases in French. And it’s used in publishing to keep things together.
+ MK: You get non-breaking hyphens as well.
+ RD: Also, the familiy character in emojii has a non-breaking space in the
  middle. Messing with those can effect rendering.
+ CG: What I can add is that in our use cases, we also have a custom
  serialization for BaseX. Maybe we shouldn’t use adaptive at all. As MK says,
  it’s difficult to give an answer for every use case.
+ RD: With numbers, don’t we have the decimal format specifier to indicate how to format numbers?
+ MK: You could add lots of parameters, but it’s hard to imagine them all being used.
+ RD: The default should be usable but provide options for users to override that.
+ CG: It can be tricky, because it depends on where you use it, which is also implementation-dependent.
  + … You can use it for trace output, but you don’t have to, …
+ MK: You can see the output actually being someting interactive, where it’s
  clickable, or copy-and-pastable.

The current state isn’t satisfying.

+ CG: What would the drawback be if we made more features implementation-defined? 
+ RD: You run into interoperability problems.
+ MK: One advantage of making it implementation-defined is that it discourages
  people from believing that it’s intended to be machine readable.
  + … Making it clear that this isn’t intended to be consistent.
+ CG: Okay, maybe I’ll have another try.
+ WP: I think the big risk is that people will be surprised by the changes.
  + … I think what we’ve heard is correct, it’s not really a solvable problem in the standards.

CG will make another PR.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

None heard.

