meeting/minutes/2026/05-12.html
<div id="outline-container-pr-2594" class="outline-3">
<h3 id="pr-2594"><span class="section-number-3">2.8.</span> PR #2594: 2389 Adaptive Serialization: more freedom</h3>
<div class="outline-text-3" id="text-pr-2594">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2594">#2594</a>
</p>

<ul class="org-ul">
<li>CG: This basically results from user feedback. It effects the adaptive serialization method.</li>
<li>CG: As JSON becomes more common, we regularly encounter numbers that
represented as doubles, so 100 becomes 1E2.
<ul class="org-ul">
<li>… To make the adaptive serialization more useful, I propose making some of
these more implementation defined.</li>
</ul></li>
<li>CG: The “&amp;” needs to be escaped to “&amp;amp;” in strings for XQuery, but not for XPath.</li>
<li>MK: The question is what are we trying to achieve. The reason for the numeric
format had in mind a sort of debugging use case.
<ul class="org-ul">
<li>… It’s intended to signal that it’s a double not an integer. It allows users
to tell that it’s not an integer. That’s appropriate for some use cases and not others.</li>
<li>… Generally, the whole issue of escaping characters that might be hard to distinguish is tricky.</li>
<li>… I thought it was a bit odd to escape  “&amp;” without also escaping angle brackets. But I can’t give a precise rational.</li>
</ul></li>
<li>RD: The challenge with things like non-breaking space is that it’s used in
some cases in French. And it’s used in publishing to keep things together.</li>
<li>MK: You get non-breaking hyphens as well.</li>
<li>RD: Also, the familiy character in emojii has a non-breaking space in the
middle. Messing with those can effect rendering.</li>
<li>CG: What I can add is that in our use cases, we also have a custom
serialization for BaseX. Maybe we shouldn’t use adaptive at all. As MK says,
it’s difficult to give an answer for every use case.</li>
<li>RD: With numbers, don’t we have the decimal format specifier to indicate how to format numbers?</li>
<li>MK: You could add lots of parameters, but it’s hard to imagine them all being used.</li>
<li>RD: The default should be usable but provide options for users to override that.</li>
<li>CG: It can be tricky, because it depends on where you use it, which is also implementation-dependent.
<ul class="org-ul">
<li>… You can use it for trace output, but you don’t have to, …</li>
</ul></li>
<li>MK: You can see the output actually being someting interactive, where it’s
clickable, or copy-and-pastable.</li>
</ul>

<p>
The current state isn’t satisfying.
</p>

<ul class="org-ul">
<li>CG: What would the drawback be if we made more features implementation-defined?</li>
<li>RD: You run into interoperability problems.</li>
<li>MK: One advantage of making it implementation-defined is that it discourages
people from believing that it’s intended to be machine readable.
<ul class="org-ul">
<li>… Making it clear that this isn’t intended to be consistent.</li>
</ul></li>
<li>CG: Okay, maybe I’ll have another try.</li>
<li>WP: I think the big risk is that people will be surprised by the changes.
<ul class="org-ul">
<li>… I think what we’ve heard is correct, it’s not really a solvable problem in the standards.</li>
</ul></li>
</ul>

<p>
CG will make another PR.
</p>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
None heard.
</p>
</div>
</div>
</div>
</body>
</html>
